"""
Написать функцию check_password, которая будет принимать строку и проверять,
что она является паролем, который соответствует следующим правилам:
1. Длина от 8 до 40 символов
2. Должен включать букву верхнего регистра
3. Должен включать букву нижнего регистра
4. Должен включать цифру
5. Должен включать символ (из некоторого набора или исключения)

Подсказка:
Понадобится позитивный просмотр вперед (?=чтото)
"""
import re


def check_password(password: str) -> bool:
    if re.match('^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[%$^*@#_]){8,40}', password):
        return True
    else:
        return False
